;--------------------------------------------------------
; I2C Code
;--------------------------------------------------------
; Даем старт на линию I2C
IIC_START:	OUTI	TWCR,1<<TWINT|1<<TWSTA|1<<TWEN|0<<TWIE

IIC_S:		IN		r16,TWCR
			ANDI	r16,1<<TWINT			
			BREQ	IIC_S		; Ждем пока передатчик IIC выполнит старт
			RET
 
;-----------------------------------------------------------------------------
;Посылаем байт по IIC 
IIC_BYTE:  	OUT		TWDR,r16
			OUTI	TWCR,1<<TWINT|1<<TWEN|0<<TWIE
IIC_B:		IN		r16,TWCR
			ANDI	r16,1<<TWINT	; Ждем пока передатчик пошлет байт			
			BREQ	IIC_B
			RET
 
;-----------------------------------------------------------------------------
; Принять байт. 
IIC_RCV:	OUTI	TWCR,1<<TWINT|1<<TWEN|1<<TWEA|0<<TWIE
IIC_R:		IN		r16,TWCR
			ANDI	r16,1<<TWINT			
			BREQ	IIC_R		; Ждем пока байт будет принят
			RET
 
;-----------------------------------------------------------------------------
; Принять последний байт. Помните я писал о разнице между просто байтом и последним
; байтом? В последнем байте не генерируется ACK!!!
IIC_RCV2:	OUTI	TWCR,1<<TWINT|1<<TWEN|0<<TWEA|0<<TWIE
IIC_R2:		IN		r16,TWCR
			ANDI	r16,1<<TWINT	; Ждем пока байт будет принят		
			BREQ	IIC_R2
			RET
 
;-----------------------------------------------------------------------------
; Сгенерировать STOP
IIC_STOP:	OUTI	TWCR,1<<TWINT|1<<TWSTO|1<<TWEN|0<<TWIE
 
;IIC_ST:		IN		r16,TWCR
;			ANDI	r16,1<<TWSTO			
;			BREQ	IIC_ST		; Ждем пока не будет готов стоп.
			RET
